cases/Biofilm_growth/single_pore/0/CbyC0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField    nonuniform List<scalar> 
38000
(
0.4
0.4
0.4
0.4
0.4
0.4
0.4
0.4
...
0.4

);


boundaryField
{

    left
    {
         type            fixedValue;
       value	       uniform 0.6;
    }

    right
    {
// type            fixedValue;
 //      value	       uniform 0;        
type           zeroGradient;
 // value	       uniform 0;
    }

    bottom
    {
 // type           zeroGradient;
type            fixedValue;
     value	       uniform 0;
    }

    top
    {
 // type           zeroGradient;
     type            fixedValue;
  value	       uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
