cases/Biofilm_growth/single_pore/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          76000;
        startFace       75610;
    }
    top
    {
        type            patch;
        nFaces          200;
        startFace       151610;
    }
    bottom
    {
        type            patch;
        nFaces          200;
        startFace       151810;
    }
    left
    {
        type            patch;
        nFaces          190;
        startFace       152010;
    }
    right
    {
        type            patch;
        nFaces          190;
        startFace       152200;
    }
)

// ************************************************************************* //
